app/controllers/blocks_controller.rb

  def index
    @blocks = Block.paginate :order => 'updated_at DESC', :per_page => 5, :page => params[:page], :conditions => {:shared => true}
---
SELECT * FROM "blocks" WHERE ("blocks"."shared" = 't') ORDER BY updated_at DESC LIMIT 5 OFFSET 0

  def show
    @block = Block.find(params[:id])
---
SELECT * FROM "blocks" WHERE ("blocks"."id" = 1)

  def create
    @block = Block.new(params[:block])
    @block.owner = session[:session_id].to_i
    @block.last_revision = 0

    if !params[:block][:revision_attr][:snippet].blank? && @block.save
---
INSERT INTO "blocks" ("created_at", "updated_at", "last_revision", "shared", "owner") VALUES('2010-03-15 02:15:09', '2010-03-15 02:15:09', 0, 'f', 887)
INSERT INTO "revisions" ("created_at", "updated_at", "block_id", "revision_number", "snippet", "file_type_id") VALUES('2010-03-15 02:15:09', '2010-03-15 02:15:09', 1, 1, 'Testing private block', NULL)

  def edit
    @block = Block.find(params[:id])
    @revision = @block.revisions.last
---
SELECT * FROM "blocks" WHERE ("blocks"."id" = 1)
SELECT * FROM "revisions" WHERE ("revisions".block_id = 1) ORDER BY revisions.id DESC LIMIT 1

  def update
    @block = Block.find(params[:id])
    params[:block][:last_revision] = params[:block][:revision_attr][:revision_number].to_i + 1
    if @block.update_attributes(params[:block])
---
SELECT * FROM "blocks" WHERE ("blocks"."id" = 1)
UPDATE "blocks" SET "updated_at" = '2010-03-15 02:15:10', "last_revision" = 2, "shared" = 'f' WHERE "id" = 1

  def destroy
    @block = Block.find(params[:id])
    @block.destroy
---
SELECT * FROM "blocks" WHERE ("blocks"."id" = 1)
DELETE FROM "blocks" WHERE "id" = 1