app/controllers/revisions_controller.rb

SELECT * FROM "blocks" WHERE ("blocks"."id" = 1)
SELECT * FROM "revisions" WHERE ("revisions".block_id = 1)
---
  def show
    @block = Block.find(params[:block_id])
    @revision = Revision.find(params[:id])